{
  "backend/main.mo": "Motoko canister managing products and form submissions with filtering, sorting, and retrieval functions.",
  "feature_evidence.json": "Feature evidence report mapping project features to related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Tailwind base styles with OKLCH variable definitions for light and dark themes and global background/text setup.",
  "frontend/index.html": "HTML entry point defining root container and loading the main React script.",
  "frontend/src/App.tsx": "Main app routing setup with TanStack Router, page routes, theme provider, and shared layout.",
  "frontend/src/components/about/ValuesTimeline.tsx": "Displays four brand values with icons, titles, and descriptions in a responsive grid.",
  "frontend/src/components/contact/ContactForm.tsx": "Contact form with validation, input fields, and submission via React Query mutation.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer with brand info, navigation links, social icons, and Caffeine.ai attribution.",
  "frontend/src/components/layout/SiteHeader.tsx": "Responsive site header with logo, desktop navigation links, and mobile menu toggle.",
  "frontend/src/components/product/ProductGallery.tsx": "Displays a main product image with selectable thumbnails and fallback image support.",
  "frontend/src/components/product/SizeSelector.tsx": "Renders selectable size buttons, highlighting the active choice.",
  "frontend/src/components/shop/ProductGrid.tsx": "Shows a grid of product cards with images, pricing, and a button to view details.",
  "frontend/src/components/shop/ShopFilters.tsx": "Provides search, category, price range, and sort controls for filtering shop products.",
  "frontend/src/hooks/mutations/useContactMutation.ts": "React Query mutation for submitting contact form data with success and error toasts.",
  "frontend/src/hooks/queries/useProductQuery.ts": "Fetches a single product by ID using an actor, enabling only when ready.",
  "frontend/src/hooks/queries/useProductsQuery.ts": "Retrieves all products from the backend actor when available.",
  "frontend/src/hooks/useActor.ts": "Initializes and manages an authenticated or anonymous backend actor, refreshing dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for Internet Identity handling login, logout, and stored identity loading.",
  "frontend/src/index.css": "Tailwind CSS setup defining custom color variables for light and dark themes.",
  "frontend/src/main.tsx": "Application entry point setting up React Query, Internet Identity provider, and rendering App.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with sections describing the brand story, craftsmanship, materials, and sustainability, including images and text blocks.",
  "frontend/src/pages/ContactPage.tsx": "Displays contact information (email, phone, location) and includes a form component for user inquiries.",
  "frontend/src/pages/HomePage.tsx": "Provides the homepage layout including a hero section, value propositions, and a featured collection teaser with images and CTA buttons.",
  "frontend/src/pages/ProductDetailsPage.tsx": "Fetches and displays detailed product info with gallery, price, description, size selector, and an add-to-cart action with error handling.",
  "frontend/src/pages/ShopPage.tsx": "Shows the product catalog with filters, sorting, search, and category selection, fetching items and rendering them in a grid.",
  "frontend/tailwind.config.js": "Configures TailwindCSS with custom colors, fonts, container settings, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Stores the project’s current website plan, features, and image requirements for a premium shoe brand. Includes versioned feature definitions for each required page and functionality."
}